# Table of Contents
 <p><div class="lev1"><a href="#Example"><span class="toc-item-num">1&nbsp;&nbsp;</span>Example</a></div>

In [24]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
import pandas as pd

In [16]:
from IPython.core.display import HTML
HTML('<style>{}</style>'.format(open('./color_df.css').read()))

In [17]:
df = pd.DataFrame({'Name' : ['Mike', 'Mikael'],
                   'Height' : [170, 60],
                   'Weight' : [188, 95]}, columns=[['Name', 'Height', 'Weight']])

In [18]:
df.head()

     Name  Height  Weight
0    Mike     170     188
1  Mikael      60      95

melt: a type of unpivoting

wide format -> long format

In [20]:
formatted_df = pd.melt(df, 
        id_vars=['Name'],
        value_vars=['Height', 'Weight'])

formatted_df

     Name variable  value
0    Mike   Height    170
1  Mikael   Height     60
2    Mike   Weight    188
3  Mikael   Weight     95

In [31]:
formatted_df.pivot(index='Name', columns='variable')
formatted_df.pivot(index='Name', columns='variable', values='value')

          value
variable Height Weight
Name
Mikael       60     95
Mike        170    188

variable  Height  Weight
Name
Mikael        60      95
Mike         170     188

In [32]:
formatted_df.pivot(index='Name', columns='variable', values='value').reset_index()
df

variable    Name  Height  Weight
0         Mikael      60      95
1           Mike     170     188

     Name  Height  Weight
0    Mike     170     188
1  Mikael      60      95

# Example

In [35]:
import sys
if sys.version_info[0] < 3: 
    from StringIO import StringIO
else:
    from io import StringIO

In [37]:
df = pd.read_csv(StringIO('''
UID test test_value
uid1 ring1 100
uid1 ring2 103
uid1 ring3 99
uid2 ring1 99
uid2 ring2 101
uid2 ring3 102
'''),
delim_whitespace=True)

df

    UID   test  test_value
0  uid1  ring1         100
1  uid1  ring2         103
2  uid1  ring3          99
3  uid2  ring1          99
4  uid2  ring2         101
5  uid2  ring3         102

In [44]:
df.pivot(index='UID', columns='test')
df_galaxy = df.pivot(index='UID', columns='test', values='test_value')
df_galaxy

     test_value
test      ring1 ring2 ring3
UID
uid1        100   103    99
uid2         99   101   102

test  ring1  ring2  ring3
UID
uid1    100    103     99
uid2     99    101    102

In [50]:
df_galaxy.reset_index(inplace=True)

In [51]:
pd.melt(df_galaxy, 
        id_vars=['UID'],
        value_vars=['ring1', 'ring2', 'ring3'])

    UID   test  value
0  uid1  ring1    100
1  uid2  ring1     99
2  uid1  ring2    103
3  uid2  ring2    101
4  uid1  ring3     99
5  uid2  ring3    102

In [53]:
_.sort_values(by=['UID', 'test'])

    UID   test  value
0  uid1  ring1    100
2  uid1  ring2    103
4  uid1  ring3     99
1  uid2  ring1     99
3  uid2  ring2    101
5  uid2  ring3    102